loadtest/scripts/example_with_attack.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 60
      arrivalRate: 40
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
      User-Agent: 'assert("asserting something");Mozilla/5.0'

scenarios:
  - flow:
    - get:
        url: "/404/?t=<script>alert()</script>"